//=========================================================================
// 役割		：UIスコア処理
// 製作者	：野村俊太郎
//=========================================================================
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;

//=========================================================================
// クラス：スコア
//=========================================================================
public class UIScore : MonoBehaviour {

	// public変数
	public GameObject	m_NumObj;		// オブジェクト：得点

	// private変数
	private int			m_Value;		// 得点
	private Text		m_NumText;		// テキスト：得点

	//=========================================================================
	// 初期化処理
	//=========================================================================
	void Start () {

		// コンポーネント取得：テキスト
		m_NumText = m_NumObj.GetComponent<Text>();
		
		m_Value = 0;
		m_NumText.text = m_Value.ToString("D8");
	}
	
	//=========================================================================
	// 更新処理
	//=========================================================================
	void Update () {
		
	}

	//=========================================================================
	// 増減処理
	//=========================================================================
	void AddValue(int inAdd)
	{
		// 加算
		m_Value += inAdd;

		// 例外処理
		if(m_Value >= 99999999) m_Value = 99999999;

		// テキスト代入
		m_NumText.text = m_Value.ToString("D8");

	}
}
